Revit 2026 API

# ResolutionTarget Enumeration

---

Indicates the resolution target(Screen or Printer) used for rendering settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ResolutionTarget
```
```vb
Public Enumeration ResolutionTarget
```
```cpp
public enum class ResolutionTarget
```
```fsharp
type ResolutionTarget
```

| Member name | Value | Description |
| --- | --- | --- |
| Printer | 1 | Uses printer resolution for rendering output settings. |
| Screen | 0 | Uses screen resolution for rendering output settings. |

#### Reference

Autodesk.Revit.DB Namespace